Repository: amrosama5/todo_firebase
Catalog: lib/l10n/app_*.arb
Languages: ar

# language
source: Arabic
ar: اللغة العربية

# theme
source: dark mode
ar: الوضع الداكن

source: Add Task
ar: إضافة مهمة

source: Select Time
ar: حدد الوقت

source: Title
ar: العنوان

source: Description
ar: الوصف

# appbarName
source: To do List
ar: قائمة المهام

source: Edit
ar: تعديل

# appName
source: Todo App
ar: تطبيق المهام

source: Done!
ar: المهمة تمت

source: Delete
ar: مسح

# doneEdit
source: Done Edited
ar: تم التعديل

source: Edit Task
ar: تعديل المهمة

source: Please change title or description
ar: من فضلك قم بتعديل العنوان او الوصف

# doneCreate
source: Done account created
ar: تم إنشاء الحساب

source: Hello
ar: مرحبا

source: Login
ar: تسجيل دخول

source: Email
ar: البريد الالكتروني

source: Password
ar: كلمة السر

source: Name
ar: الآسم

source: Phone
ar: رقم الهاتف

source: Register
ar: إنشاء حساب

source: weak-password
ar: كلمة السر ضعيفة

# emailAlreadyInUse
source: The account already exists for that email.
ar: هذا الحساب موجود بالفعل بهذا البريد

source: something went wrong
ar: يوجد خظأ ما

# userNotFound
source: No user found for that email.
ar: لم يتم العثور علي المستخدم لهذا البريد

# wrongPassword
source: Wrong password provided for that user.
ar: كلمة السر خظأ

source: Error
ar: خطأ

# verifyEmail
source: Please verify your email
ar: من فضلك قم بتاكيد الحساب عبر البريد الالكتروني

# emailValid
source: Email not valid
ar: البريد الالكتروني غير صحيح

source: password must at least 6 char
ar: يجب كلمة السر تكون علي الاقل 6 احرف

source: Password must not be empty
ar: يجب وضع كلمة السر

source: Email must not be empty
ar: يجب وضع البريد الالكتروني

source: Phone must not be empty
ar: يجب وضع رقم الهاتف

source: Name must not be empty
ar: يجب وضع الاسم

source: Not have tasks
ar: لا يوجد مهام

source: title must not be empty
ar: يجب وضع العنوان

source: description must not be empty
ar: يجب وضع الوصف
